Infineon/AURIX_code_examples/code_examples/iLLD_TC375_ADS_SCR_UART/Libraries/Infra/Sfr/TC37x/IfxMtu_bf.h
/** \brief Length for Ifx_MTU_MEMTEST0_Bits.CPU1_DTAG_EN */
#define IFX_MTU_MEMTEST0_CPU1_DTAG_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST0_Bits.CPU1_DTAG_EN */
#define IFX_MTU_MEMTEST0_CPU1_DTAG_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST0_Bits.CPU1_DTAG_EN */
#define IFX_MTU_MEMTEST0_CPU1_DTAG_EN_OFF (6u)

/** \brief Length for Ifx_MTU_MEMTEST0_Bits.CPU1_PMEM_EN */
#define IFX_MTU_MEMTEST0_CPU1_PMEM_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST0_Bits.CPU1_PMEM_EN */
#define IFX_MTU_MEMTEST0_CPU1_PMEM_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST0_Bits.CPU1_PMEM_EN */
#define IFX_MTU_MEMTEST0_CPU1_PMEM_EN_OFF (7u)

/** \brief Length for Ifx_MTU_MEMTEST0_Bits.CPU1_PTAG_EN */
#define IFX_MTU_MEMTEST0_CPU1_PTAG_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST0_Bits.CPU1_PTAG_EN */
#define IFX_MTU_MEMTEST0_CPU1_PTAG_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST0_Bits.CPU1_PTAG_EN */
#define IFX_MTU_MEMTEST0_CPU1_PTAG_EN_OFF (8u)

/** \brief Length for Ifx_MTU_MEMTEST0_Bits.CPU1_DLMU_STBY_EN */
#define IFX_MTU_MEMTEST0_CPU1_DLMU_STBY_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST0_Bits.CPU1_DLMU_STBY_EN */
#define IFX_MTU_MEMTEST0_CPU1_DLMU_STBY_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST0_Bits.CPU1_DLMU_STBY_EN */
#define IFX_MTU_MEMTEST0_CPU1_DLMU_STBY_EN_OFF (9u)

/** \brief Length for Ifx_MTU_MEMTEST0_Bits.CPU2_DMEM_EN */
#define IFX_MTU_MEMTEST0_CPU2_DMEM_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST0_Bits.CPU2_DMEM_EN */
#define IFX_MTU_MEMTEST0_CPU2_DMEM_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST0_Bits.CPU2_DMEM_EN */
#define IFX_MTU_MEMTEST0_CPU2_DMEM_EN_OFF (10u)

/** \brief Length for Ifx_MTU_MEMTEST0_Bits.CPU2_DTAG_EN */
#define IFX_MTU_MEMTEST0_CPU2_DTAG_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST0_Bits.CPU2_DTAG_EN */
#define IFX_MTU_MEMTEST0_CPU2_DTAG_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST0_Bits.CPU2_DTAG_EN */
#define IFX_MTU_MEMTEST0_CPU2_DTAG_EN_OFF (11u)

/** \brief Length for Ifx_MTU_MEMTEST0_Bits.CPU2_PMEM_EN */
#define IFX_MTU_MEMTEST0_CPU2_PMEM_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST0_Bits.CPU2_PMEM_EN */
#define IFX_MTU_MEMTEST0_CPU2_PMEM_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST0_Bits.CPU2_PMEM_EN */
#define IFX_MTU_MEMTEST0_CPU2_PMEM_EN_OFF (12u)

/** \brief Length for Ifx_MTU_MEMTEST0_Bits.CPU2_PTAG_EN */
#define IFX_MTU_MEMTEST0_CPU2_PTAG_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST0_Bits.CPU2_PTAG_EN */
#define IFX_MTU_MEMTEST0_CPU2_PTAG_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST0_Bits.CPU2_PTAG_EN */
#define IFX_MTU_MEMTEST0_CPU2_PTAG_EN_OFF (13u)

/** \brief Length for Ifx_MTU_MEMTEST0_Bits.CPU2_DLMU_EN */
#define IFX_MTU_MEMTEST0_CPU2_DLMU_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST0_Bits.CPU2_DLMU_EN */
#define IFX_MTU_MEMTEST0_CPU2_DLMU_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST0_Bits.CPU2_DLMU_EN */
#define IFX_MTU_MEMTEST0_CPU2_DLMU_EN_OFF (14u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.CPU0_DMEM1_EN */
#define IFX_MTU_MEMTEST1_CPU0_DMEM1_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.CPU0_DMEM1_EN */
#define IFX_MTU_MEMTEST1_CPU0_DMEM1_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.CPU0_DMEM1_EN */
#define IFX_MTU_MEMTEST1_CPU0_DMEM1_EN_OFF (2u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.CPU1_DMEM1_EN */
#define IFX_MTU_MEMTEST1_CPU1_DMEM1_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.CPU1_DMEM1_EN */
#define IFX_MTU_MEMTEST1_CPU1_DMEM1_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.CPU1_DMEM1_EN */
#define IFX_MTU_MEMTEST1_CPU1_DMEM1_EN_OFF (3u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.DAM0_EN */
#define IFX_MTU_MEMTEST1_DAM0_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.DAM0_EN */
#define IFX_MTU_MEMTEST1_DAM0_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.DAM0_EN */
#define IFX_MTU_MEMTEST1_DAM0_EN_OFF (6u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.SADMA_EN */
#define IFX_MTU_MEMTEST1_SADMA_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.SADMA_EN */
#define IFX_MTU_MEMTEST1_SADMA_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.SADMA_EN */
#define IFX_MTU_MEMTEST1_SADMA_EN_OFF (9u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.MINI_MCDS_EN */
#define IFX_MTU_MEMTEST1_MINI_MCDS_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.MINI_MCDS_EN */
#define IFX_MTU_MEMTEST1_MINI_MCDS_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.MINI_MCDS_EN */
#define IFX_MTU_MEMTEST1_MINI_MCDS_EN_OFF (10u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.GTM_FIFO_EN */
#define IFX_MTU_MEMTEST1_GTM_FIFO_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.GTM_FIFO_EN */
#define IFX_MTU_MEMTEST1_GTM_FIFO_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.GTM_FIFO_EN */
#define IFX_MTU_MEMTEST1_GTM_FIFO_EN_OFF (21u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.GTM_MCS0FAST_EN */
#define IFX_MTU_MEMTEST1_GTM_MCS0FAST_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.GTM_MCS0FAST_EN */
#define IFX_MTU_MEMTEST1_GTM_MCS0FAST_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.GTM_MCS0FAST_EN */
#define IFX_MTU_MEMTEST1_GTM_MCS0FAST_EN_OFF (23u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.GTM_MCS1FAST_EN */
#define IFX_MTU_MEMTEST1_GTM_MCS1FAST_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.GTM_MCS1FAST_EN */
#define IFX_MTU_MEMTEST1_GTM_MCS1FAST_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.GTM_MCS1FAST_EN */
#define IFX_MTU_MEMTEST1_GTM_MCS1FAST_EN_OFF (25u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.GTM_DPLL1A_EN */
#define IFX_MTU_MEMTEST1_GTM_DPLL1A_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.GTM_DPLL1A_EN */
#define IFX_MTU_MEMTEST1_GTM_DPLL1A_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.GTM_DPLL1A_EN */
#define IFX_MTU_MEMTEST1_GTM_DPLL1A_EN_OFF (26u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.GTM_DPLL1BC_EN */
#define IFX_MTU_MEMTEST1_GTM_DPLL1BC_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.GTM_DPLL1BC_EN */
#define IFX_MTU_MEMTEST1_GTM_DPLL1BC_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.GTM_DPLL1BC_EN */
#define IFX_MTU_MEMTEST1_GTM_DPLL1BC_EN_OFF (27u)

